'''
Напишите программу, которая в последовательности натуральных чисел определяет максимальное число, кратное 5.
Программа получает на вход количество чисел в последовательности, а затем сами числа. В последовательности всегда имеется число, кратное 5.
Количество чисел не превышает 1000. Введенные числа не превышают 30 000.
Программа должна вывести одно число — максимальное число, кратное 5.
'''

print("Hello, Stas!")